{"metadata": {"doc_id": "demo123::p1", "title": "Burning Mouth Syndrome", "source_url": "https://www.nidcr.nih.gov/sites/default/files/2023-12/burning-mouth-syndrome.pdf", "content_type": "pdf_report", "page_number": 1, "section_heading": "Page 1", "category_path": ["Publications"], "publisher": "National Institute of Dental and Craniofacial Research", "license": "Public domain (US federal government)", "license_url": "https://www.nidcr.nih.gov/about-us/web-policies", "attribution": "Content courtesy of the National Institute of Dental and Craniofacial Research (NIDCR)", "ingestion_notes": ["seed:publications"], "language": "en", "retrieved_at": "2025-11-03T10:05:00Z"}, "text": "¾Burning mouth syndrome is burning pain in the mouth that may occur every day \nfor months or longer.\n ¾Burning mouth syndrome can be difficult to diagnose, and your dentist or doctor will rule out other conditions before diagnosing burning mouth syndrome. Advocating for yourself and forming a partnership with a dentist or doctor you \ntrust can be helpful throughout the process of getting a diagnosis.\n ¾No specific treatment works for all people. However, your health care provider(s) will help you understand your condition, encourage strategies to reduce burning sensations, and may prescribe medicine to help you manage mouth pain, dry mouth, \nor other symptoms.\nThe main symptom of burning mouth syndrome (BMS) is pain in the mouth that feels like \nburning, scalding, or tingling. Or, the pain may happen with a feeling of numbness, which comes and goes. Other symptoms include dry mouth or altered taste in the mouth.\nBMS is a painful condition. Usually, the tongue is affected but the pain may also be in the \nlips or roof of the mouth, or throughout the mouth.\nBMS pain can last for months or years. Some people feel constant pain every day. \nFor others, pain increases throughout the day. For many people, the pain is reduced when eating or drinking.\nBMS is hard to diagnose. One reason is that people with BMS often don’t have a mouth \nproblem that can be seen during an exam.\nTalk to your dentist first. About one-third of people with BMS have an oral habit such as \ntooth grinding or jaw clenching that can lead to BMS. Dentists are familiar with oral habits and can help you manage them.\nYour dentist may refer you to a specialist in oral surgery, oral medicine, or oral pathology \nwho can assist with diagnosing or treating BMS. Ear, nose, and throat specialists can also treat this condition.\nThe dentist or doctor will review your medical history and thoroughly examine your \nmouth. A lot of tests may be needed. Tests may include:\n ¾Blood tests to check for certain medical problems\n ¾Oral swab tests\n ¾Allergy tests\n ¾Salivary flow test \n ¾Biopsy of tissue\n ¾Imaging tests DIAGNOSIS SYMPTOMSKEY POINTS\nBurning Mouth \nSyndrome", "headings": []}
{"metadata": {"doc_id": "demo123::p2", "title": "Burning Mouth Syndrome", "source_url": "https://www.nidcr.nih.gov/sites/default/files/2023-12/burning-mouth-syndrome.pdf", "content_type": "pdf_report", "page_number": 2, "section_heading": "Secondary Bms", "category_path": ["Publications"], "publisher": "National Institute of Dental and Craniofacial Research", "license": "Public domain (US federal government)", "license_url": "https://www.nidcr.nih.gov/about-us/web-policies", "attribution": "Content courtesy of the National Institute of Dental and Craniofacial Research (NIDCR)", "ingestion_notes": ["seed:publications"], "language": "en", "retrieved_at": "2025-11-03T10:05:00Z"}, "text": "Primary BMS: If tests do not reveal an underlying medical problem, the diagnosis is \nprimary BMS. Experts believe that primary BMS is caused by damage to the nerves that control pain and taste.\nSecondary BMS: Certain medical conditions can cause BMS. Treating the medical \nproblem will cure the secondary BMS. Common causes of secondary BMS include:\n ¾Oral habits, such as tooth grinding or jaw clenching\n ¾Depression\n ¾Hormonal changes, such as from diabetes or a thyroid problem\n ¾Allergies to dental products, dental materials (usually metals), or foods\n ¾Dry mouth, which can be caused by certain disorders (such as Sjögren’s syndrome) \nand treatments (such as certain drugs and radiation therapy) \n ¾Certain medicines, such as those that reduce blood pressure\n ¾Nutritional deficiencies, such as a low level of vitamin B or iron\n ¾Infection in the mouth, such as a yeast infection\n ¾Acid reflux\nYour dentist or doctor will help you get relief.\n ¾Your dentist may help you manage oral habits that contribute to BMS, such as tooth grinding or jaw clenching.\n ¾Your dentist or doctor may prescribe medication that can help control pain and relieve dry mouth. Sometimes a small dose of topical or systemic clonazepam might help with BMS pain.\nBecause BMS is a complex pain disorder, the treatment that works for one person may not work for another.\nSymptoms of secondary BMS go away when the underlying medical condition, such as \ndiabetes or yeast infection, is treated. If a drug is causing secondary BMS, your doctor may \nswitch you to a new medicine.\nTo help ease the pain of BMS, sip a cold beverage, suck on ice chips, or chew \nsugarless gum.\nAvoid irritating substances, such as:\n ¾Tobacco\n ¾Hot, spicy foods\n ¾Alcoholic beverages\n ¾Mouthwashes that contain alcohol\n ¾Products high in acid, such as citrus fruits and juicesHELPFUL TIPSTREATMENTPRIMARY AND \nSECONDARY BMS\nU.S. DEPARTMENT OF \nHEALTH AND HUMAN SERVICES\nNational Institutes of Health\nNIH Publication No. 23-6288 \nNovember 2023Ask your dentist and doctor for other helpful tips.\nNational Institute of Dental and Craniofacial Research \n1–866–232–4528 \nwww.nidcr.nih.gov\nThis publication is not copyrighted. Make as many photocopies as you need.", "headings": ["Secondary Bms", "U.S. Department Of", "Health And Human Services"]}
